app/controllers/at_bats_controller.rb

    def create
        @at_bat.attributes = params[:at_bat]

        respond_to do |format|
            format.js do
                render :update do |page|
                    # use transaction to rollback any changes in the event of an exception with redis
                    AtBat.transaction do
                        # assumes everything is going to be saved correctly because there are no validations
                        @at_bat.save
---
INSERT INTO `at_bats` (`position`, `created_at`, `updated_at`, `version`, `pitches`, `game_id`) VALUES(15, '2010-11-02 04:18:26', '2010-11-02 04:18:26', 'e9b651f0249bb441ae76a526e94070f07f802192', x'04085b06220b737472696b65', 1)

    def update
        respond_to do |format|
            format.js do
                render :update do |page|
                    # use transaction to rollback any changes in the event of an exception with redis
                    AtBat.transaction do
                        @at_bat.update_attributes(params[:at_bat])
---
UPDATE `at_bats` SET `pitches` = x'04085b08220b737472696b65220c20737472696b65220c20737472696b65', `updated_at` = '2010-11-02 05:58:27', `version` = 'f2e597e9967d0f43f330a0bec3ef6f3114fbc730' WHERE `id` = 22

    def destroy
        @at_bat.destroy
---
DELETE FROM `at_bats` WHERE `id` = 80