app/controllers/games_controller.rb

  def real_time
    @game = Game.find(params[:id])
---
SELECT * FROM `games` WHERE (`games`.`id` = 1)

  def index
    @games = Game.all
---
SELECT * FROM `games`

  def show
    @game = Game.find(params[:id])
---
SELECT * FROM `games` WHERE (`games`.`id` = 1)

  def create
    @game = Game.new(params[:game])

    respond_to do |format|
      if @game.save
---
INSERT INTO `games` (`name`, `created_at`, `updated_at`, `description`) VALUES('game2', '2010-11-04 01:16:14', '2010-11-04 01:16:14', 'just another game')